Polish README and move HTML report into doc
